import { CountryNamespace } from "@/types/country";

type SeoTextProps = {
  currentCountry: CountryNamespace.GET;
};

export const SeoText = async ({ currentCountry }: SeoTextProps) => {
  return (
    <div className="container mx-auto max-w-[1144px]">
      <div className="my-8 mx-7 sm:my-20 _seo-text sm:mx-0">
        <h1 className="text-gray-600 text-[16px] inline-block sm:text-[20px] font-semibold">
          {`کـوچـا، جامعه ایرانیان مهاجر مقیم ${currentCountry.name}!`}
        </h1>
        <p className="mt-3 font-normal text-justify text-gray-500">
          در ماه‌های اولیه مهاجرت به {currentCountry.name}، موضوعاتی از قبیل
          فرآیندهای اداری اقامت، بازکردن حساب بانکی، پیدا کردن و مستقر شدن در
          خانه جدید، تامین اثاثیه، حمل و نقل و اسباب کشی، تعمیرات داخلی ساختمان،
          ثبت نام فرزندان در مدرسه، گرفتن گواهینامه رانندگی، خرید خودرو، تعمیرات
          خودرو، الزامات بانکی و بیمه‌ای، یادگیری زبان، کاریابی و حتی خدمات
          آرایش و زیبایی میتونه براتون چالش ایجاد کنه و بسته به اینکه چقدر از
          قبل با زبان و فرهنگ این کشور آشنایی داشته باشید براتون هزینه بر باشه.
          بعد از گذروندن این مراحل و جا افتادن در محل جدید زندگی، موضوعات
          دیگه‌ای مثل پیدا کردن جمع‌های دوستانه، مراجعه به پزشک و داروخانه،
          دریافت خدمات مشاوره روانشناسی و پیدا کردن وکیل کاربلد از جمله
          دغدغه‌های رایج زندگی مهاجران تو کشور {currentCountry.name} به شمار
          میاد. اگر هم تصمیم داشته باشید کسب و کار خودتون رو راه بندازید که با
          چالش‌های متفاوتی مثل قوانین و فرآیندهای مالیاتی روبرو خواهید شد. در
          چنین شرایطی دسترسی به لیست کامل و بروز مشاغل و پزشکان فارسی زبان فعال
          در سراسر {currentCountry.name} و دریافت خدمات موردنیاز به زبان مادری
          یک مزیت مهم و کاربردی به حساب میاد و میتونه باعث صرفه جویی در وقت،
          انرژی و هزینه شما بشه.
        </p>
      </div>
    </div>
  );
};
