import { Button } from "../ui";
import Link from "next/link";

export const AdsclubContent = () => {
  return (
    <section className="_about content">
      <div className="section">
        <h2>Ads Club چیست؟</h2>
        <p>
          ادزکلاب یک سرویس ارسال هدفمند برای ایرانیان مهاجر مقیم در سراسر جهانه.
          به ویژه کسانی که از شلوغی، اسپم و بی‌نظمی کانال‌ها و گروه‌های تلگرامی
          خسته شده‌اند.
        </p>
        <p>
          در AdsClub فقط کافیست کشور، شهر محل زندگی و موضوعات موردنیازتان را
          مشخص کنید تا ربات هوشمند، آگهی‌های معتبر و مطابق با نیازتان را ارسال
          کند. بدون هیچ پیام اضافه و مزاحمتی.
        </p>
        <p>
          در این سرویس حریم خصوصی کاملا محفوظ است. هیچ اطلاعات شخصی از شما
          جمع‌آوری، ذخیره یا نمایش داده نمی‌شود و هیچ آگهی‌دهنده‌ و کاربر دیگری
          به شما دسترسی ندارد.
        </p>
        <Button className="mt-2 w-full" asChild>
          <Link
            href="https://t.me/adsclubbot"
            target="_blank"
            rel="noopener noreferrer"
          >
            همین الان رایگان امتحان کنید
          </Link>
        </Button>
      </div>

      <div className="section">
        <h2 className="mb-3">چرا از AdsClub استفاده کنم؟</h2>
        <div className="[&_h3]:mt-3 [&_h3]:mb-1 [&_h3]:font-bold [&_h3]:first:mt-0 [&_p]:pr-2.5">
          <h3>🔒 حریم خصوصی کامل</h3>
          <p>
            هیچ اطلاعات شخصی دریافت و ذخیره نمی‌شود. کاربران و آگهی‌دهندگان دیگر
            به حساب شما دسترسی ندارد.
          </p>
          <h3>🎯 کنترل کامل در دست شما</h3>
          <p>
            نه الگوریتم تصمیم می‌گیرد چه ببینید، نه ادمین کانال. فقط شما موضوع
            آگهی‌های دریافتی را مدیریت می‌کنید.
          </p>

          <h3>🚫 بدون اسپم و بدون شلوغی</h3>
          <p>
            هیچ پیام تکراری، گفت‌وگوی بی‌ربط یا بمباران تبلیغاتی وجود ندارد.
            آگهی‌ها فقط یک‌بار در هفته ارسال می‌شوند.
          </p>

          <h3>✅ آگهی‌های معتبر و واقعی</h3>
          <p>
            تمام آگهی‌ها از آگهی‌دهندگان واقعی و با وسواس دریافت شده و پیش از
            ارسال دوباره بررسی می‌شوند.
          </p>

          <h3>🧭 ارسال دقیق براساس کشور، شهر و نیازهای شما</h3>
          <p>
            با انتخاب محل زندگی و موضوعات مورد علاقه، فقط آگهی‌هایی که دقیقا
            مناسب خودتان هست را می‌بینید.
          </p>

          <h3>🏅 سیستم امتیازد و سطح کاربری</h3>
          <p>
            با فعالیت در سرویس امتیاز می‌گیرید، سطح کاربری‌تان بالاتر می‌رود و
            امکانات ویژه برای شما فعال می‌شوند.
          </p>

          <h3>⚙️ ساده، سریع و بدون پیچیدگی</h3>
          <p>
            بدون فرم‌های طولانی و بدون نیاز به اطلاعات شخصی. همه‌چیز فقط در چند
            ثانیه آماده می‌شود.
          </p>
        </div>
        <Button className="mt-2 w-full" asChild>
          <Link
            href="https://t.me/adsclubbot"
            target="_blank"
            rel="noopener noreferrer"
          >
            همین الان رایگان امتحان کنید
          </Link>
        </Button>
      </div>
    </section>
  );
};
