import {
  BankIcon,
  PeaceIcon,
  ShieldIcon,
  TrophyIcon,
} from "@phosphor-icons/react/dist/ssr";
import { Button, Card, CardContent } from "../ui";
import Link from "next/link";

export const AdsclubContent = () => {
  return (
    <section className="_about content">
      <div className="section">
        <h2>سرویس Ads Club چیست؟</h2>
        <p>
          ادز کلاب یک سرویس ارسال هدفمند آگهی برای ایرانیان مهاجر سراسر دنیاست.
          به ویژه برای افرادی که از شلوغی و بی‌نظمی کانال‌ها و گروه‌های تلگرامی
          خسته شده‌اند و نمی‌خواهند وقت و انرژی خود را برای پیدا کردن آگهی‌های
          معتبر و خدمات مورد نیازشان تلف کنند.
        </p>
        <p>
          در Ads Club فقط کافی است محل سکونت و موضوعات مورد نیازتان را انتخاب
          کنید تا ربات، آگهی‌های معتبر و مرتبط با نیازهای شما را برایتان ارسال
          می‌کند. بدون پیام‌های اضافی، بدون اسپم و بدون بی‌نظمی. تمام آگهی‌ها از
          آگهی‌دهندگان معتبر دریافت می‌شود و فقط یک بار در هفته برای شما ارسال
          خواهند شد.
        </p>
        <p>
          در این سرویس، حریم خصوصی کاربران کاملا رعایت می‌شود. هیچ‌گونه اطلاعات
          شخصی از شما جمع‌آوری یا نمایش داده نمی‌شود و آگهی‌دهندگان یا کاربران
          دیگر هیچ دسترسی‌ای به اطلاعات شما ندارند. برخلاف شبکه‌های اجتماعی که
          الگوریتم‌ها یا ادمین‌ها تعیین می‌کنند چه چیزی ببینید، در AdsClub فقط
          شما تصمیم می‌گیرید چه آگهی‌هایی و با چه موضوعاتی برایتان ارسال شود.
        </p>
        <p>
          همچنین در AdsClub خبری از بمباران تبلیغاتی، پیام‌های تکراری، ربات‌های
          مزاحم و آگهی‌های نامرتبط نیست. شما فقط محتواهایی را دریافت می‌کنید که
          با علاقه‌مندی‌ها و نیازهای روزمره‌تان هماهنگ باشد.
        </p>
        <p>
          برای قدردانی از کاربران فعال، یک سیستم امتیازدهی هم طراحی شده است. با
          جمع‌کردن امتیاز، سطح کاربری شما ارتقا پیدا می‌کند و به امکانات و
          پیشنهادات ویژه دسترسی خواهید داشت.
        </p>
        <Button className="w-full" asChild>
          <Link
            href="https://t.me/adsclubbot"
            target="_blank"
            rel="noopener noreferrer"
          >
            همین الان رایگان ثبت نام کنید
          </Link>
        </Button>
      </div>

      <div className="section">
        <h2>چرا باید از AdsClub استفاده کنم؟</h2>
        <p>
          اگر در خارج از ایران زندگی می‌کنید، احتمالا می‌دانید پیدا کردن یک وکیل
          معتبر، پزشک قابل اعتماد، کلاس آموزشی باکیفیت یا حتی یک آگهی ساده
          درباره خدمات روزمره چقدر می‌تواند وقت‌گیر و خسته‌کننده باشد. مخصوصا
          وقتی مجبور شوید میان ده‌ها کانال و گروه شلوغ تلگرامی جست‌وجو کنید و با
          پیام‌های غیرمرتبط یا مزاحمت‌های ناخواسته روبه‌رو شوید.
        </p>

        <p>
          سرویس AdsClub دقیقا برای حل همین مشکل ساخته شده است. یک سرویس هوشمند
          که آگهی‌ها را به صورت هدفمند، یکطرفه، بدون مزاحمت و کاملا متناسب با
          نیازهای شما برایتان ارسال می‌کند.
        </p>

        <p>
          در ادامه، دلایل اصلی که چرا همه ایرانیان مهاجر باید از AdsClub استفاده
          کنند را لیست می‌کنیم:
        </p>

        <div className="[&_h3]:text-primary [&_h3]:mt-4 [&_h3]:mb-1 [&_h3]:font-bold [&_h3]:first:mt-0 [&_p]:pr-2.5">
          <h3>🔒 حفظ کامل حریم خصوصی</h3>
          <p>
            در AdsClub هیچ اطلاعات شخصی از شما ذخیره نمی‌شود و آگهی‌دهندگان یا
            دیگر کاربران هیچ دسترسی به حساب شما ندارند و نمی‌توانند برایتان پیام
            ارسال کنند. این یعنی تجربه‌ای امن، بدون مزاحمت و بدون دریافت
            پیام‌های ناخواسته.
          </p>
          <h3>🎯 کنترل کامل در دست شماست</h3>
          <p>
            در اینستاگرام و فیس‌بوک، این الگوریتم‌ها هستند که تصمیم می‌گیرند چه
            تبلیغات یا محتوایی به شما نمایش داده شود. در تلگرام هم معمولا
            ادمین‌ها انتخاب می‌کنند چه نوع آگهی یا محتوایی را ببینید.
          </p>
          <p className="mt-2">
            اما در AdsClub همه‌چیز متفاوت است. فقط شما مشخص می‌کنید چه موضوعاتی
            برایتان اهمیت دارد و آگهی‌ها دقیقا براساس همین انتخاب‌ها برای شما
            ارسال می‌شوند. هیچ چیز تصادفی، تحمیلی یا خارج از کنترل شما وجود
            ندارد.
          </p>

          <h3>🚫 بدون اسپم، بدون شلوغی، بدون پیام اضافی</h3>
          <p>
            در AdsClub خبری از بمباران تبلیغاتی، پیام‌های تکراری یا گفت‌وگوهای
            شلوغ و بدون محتوا نیست. دیگر لازم نیست میان صدها پیام غیرمرتبط در
            گروه‌ها اسکرول کنید تا مثلا اطلاعات یک پزشک ایرانی یا یک سرویس مورد
            نیاز را در شهر محل زندگی‌تون پیدا کنید. در اینجا آگهی‌ها فقط یک بار
            در هفته و به‌صورت شخصی در ربات برای شما ارسال می‌شوند.
          </p>

          <h3>✅ آگهی‌های واقعی و معتبر</h3>
          <p>
            تمام آگهی‌های منتشر شده در Ads Club از سوی آگهی‌دهندگان واقعی و
            معتبر پذیرفته می‌شوند و پیش از ارسال توسط تیم ما مورد بازبینی قرار
            می‌گیرد. هدف ما این است که شما بدون سردرگمی، سریع‌ترین و بهترین
            انتخاب را داشته باشید.
          </p>

          <h3>🧭 ارسال دقیق بر اساس محل زندگی و نیازهای شما</h3>
          <p>
            تنها کافی است کشور، شهر و حوزه‌های مورد علاقه‌تان را انتخاب کنید تا
            آگهی‌هایی را دریافت کنید که دقیقا با نیازها و محل سکونت شما منطبق
            هستند. اگر بخش‌های اختیاری پروفایل را هم تکمیل کنید، سیستم می‌تواند
            آگهی‌ها را حتی دقیق‌تر و شخصی‌سازی‌شده‌تر برای شما ارسال کند. همچنین
            هر زمان و براساس تغییر نیازهای‌تان، می‌توانید موضوعات مورد علاقه را
            به‌سادگی ویرایش و به‌روزرسانی کنید.
          </p>

          <h3>🏅 سیستم امتیازدهی و سطح‌های کاربری</h3>
          <p>
            در AdsClub برای افزایش جذابیت و قدردانی از کاربران فعال و وفادار، یک
            سیستم امتیازدهی طراحی کردیم. کاربران با انجام فعالیت‌های مختلف
            امتیازهای بیشتر کسب می‌کنند و سطح کاربری شان ارتقا پیدا می‌کند. با
            افزایش سطح، امکانات ویژه و اولویت‌ استفاده از آفرهای محدود و ارزشمند
            برای شما فعال می‌شود.
          </p>

          <h3>⚙️ تجربه‌ای ساده، سریع و بدون پیچیدگی</h3>
          <p>
            در AdsClub همه‌چیز در چند ثانیه و به ساده‌ترین شکل ممکن انجام
            می‌شود—بدون فرم‌های طولانی و گیج‌کننده و بدون نیاز به هرگونه اطلاعات
            شخصی.
          </p>
        </div>
        <Button className="w-full" asChild>
          <Link
            href="https://t.me/adsclubbot"
            target="_blank"
            rel="noopener noreferrer"
          >
            همین الان رایگان ثبت نام کنید
          </Link>
        </Button>
      </div>
    </section>
  );
};
