import { CalendarCheckIcon } from "@phosphor-icons/react/dist/ssr";
import Link from "next/link";

export const TermsContent = () => {
  return (
    <section className="_terms content">
      <div className="section">
        <h2>به "کـوچـا" خوش آمدید!</h2>
        <p>
          این صفحه حاوی مجموعه قوانین و مقرراتیه که به منظور ایجاد فضایی سالم و
          منصفانه، توسط تیم مدیریتی کوچا وضع شده تا علاوه بر رعایت حقوق شما
          عزیزان، تجربه خوشایندی رو در اینجا براتون رقم بزنیم.
        </p>
        <p>
          از اونجایی که رعایت این قوانین برای تمام کاربران الزامیه و ثبت نام،
          ورود به پنل کاربری و استفاده از خدمات سایت به منزله مطالعه و موافقت
          شماست، صمیمانه توصیه می‌کنیم که این قوانین رو به دقت مطالعه کنید.
        </p>
        <div className="space-y-1">
          <p className="text-destructive text-sm">
            (با توجه به اینکه قوانین در طول زمان کامل‌تر میشن، به تاریخ
            بروزرسانی اون دقت کنید)
          </p>
          <div className="text-muted-foreground flex items-center gap-1 text-sm">
            <CalendarCheckIcon size={18} weight="duotone" />
            بروز شده در مهرماه 1402
          </div>
        </div>
      </div>

      <div className="section">
        <ol>
          <li>
            <h3>حریم خصوصی کاربران</h3>
            <p>
              حفاظت از اطلاعات و حریم خصوصی کاربران جزو ارزش‌های اصلی کـوچـاست،
              از این رو تیم فنی ما تمام تلاش خود را به کار گرفته تا با استفاده
              از جدیدترین ابزارها و امن‌ترین فناوری‌های موجود در بازار فضایی امن
              را برای شما عزیزان فراهم نماید.
            </p>
          </li>

          <li>
            <h3>مالکیت معنوی</h3>
            <p>
              تمامی محتوای تولید شده توسط کـوچـا تحت مالکیت معنوی این مجموعه
              بوده و استفاده از آنها بدون هماهنگی و کسب مجوز از نظر قانونی و
              اخلافی ممنوع می‌باشد.
            </p>
          </li>
          <li>
            <h3>قوانین کاربری</h3>
            <p>
              تمامی کاربران سایت موظف به رعایت اصول اخلاقی در ارتباط با سایر
              کاربران و تیم پشتیبانی کـوچـا می‌باشند. استفاده از کلماتی که به هر
              نحو توهین به فردیت، جنسیت، ملیت، قومیت و عقاید دیگران محسوب شود
              ممنوع است.
            </p>
          </li>
          <li>
            <h3>سلب مسئولیت</h3>
            <p>
              کـوچـا پیوسته تلاش می‌کند تا بالاترین کیفیت خدمات رو به کاربران
              خود ارائه نماید دارد اما هیچ گونه مسئولیتی در قبال خدمات ارائه شده
              توسط کسب و کارها و افرادی که اطلاعات آنها در کوچا ثبت شده‌است
              ندارد و هرگونه خسارت ناشی از همکاری و استفاده از محصولات و خدمات
              آنها متوجه شما خواهد بود.
            </p>
          </li>
          <li>
            <h3>تغییرات در قوانین</h3>
            <p>
              کـوچـا اختیار دارد در هر زمان و در راستای بهبود خدماتش قوانین و
              مقررات خود را تغییر دهد. آخرین نسخه از قوانین با ذکر تاریخ
              بروزرسانی همیشه در همین صفحه به آدرس{" "}
              <Link href={"/terms"}>www.koochaa.com/terms</Link> قابل دسترس
              می‌باشد. توجه بفرمایید که ثبت نام، ورود به پنل کاربری و استفاده از
              خدمات سایت به منزله مطالعه و موافقت شما با آخرین بروزرسانی قوانین
              است.
            </p>
          </li>
          <li>
            <h3>تماس با ما</h3>
            <p>
              در صورت بروز هرگونه پرسش یا ابهام در مورد قوانین و مقررات،
              می‌توانید با تیم پشتیبانی کـوچـا تماس بگیرید. روش‌ها و اطلاعات
              بروز برقراری ارتباط با ما همیشه در صفحه تماس با ما به آدرس{" "}
              <Link href={"/contact"}>www.koochaa.com/contact</Link> قرار دارد.
            </p>
          </li>
        </ol>
      </div>

      <p className="text-center">
        از اعتماد و همراهی شما صمیمانه سپاسگزاریم. امیدواریم تجربه‌ خوشایندی در
        استفاده از خدمات ما داشته باشید.
      </p>
    </section>
  );
};
