import Image from 'next/image';

const TextSec = () => {
  return (
    <div className='container mx-auto mt-6 max-w-[1144px] px-3 sm:mt-10 sm:px-0'>
      <div className='text-wrap'>
        <div className='section'>
          <h2>کوچا، تلاشی برای رفع نیازهای فارسی‌زبانان مهاجر</h2>
          <p>
            در چند دهه گذشته بواسطه شرایط نامساعد زندگی در کشورهای فارسی‌زبان
            بویژه ایران و افغانستان تعداد زیادی از هم‌زبانان عزیزمون مجبور به
            ترک سرزمین مادری‌شون شدن و واژه مهاجرت به بخش جداناپذیری از گفتمان
            روزانه مردم این منطقه تبدیل شده.
          </p>
          <p>
            رشد بی‌سابقه نرخ مهاجرت چالش‌های گوناگونی رو در زندگی مهاجران و
            خانواده‌هاشون ایجاد کرده که متاسفانه هنوز خدمات و راهکارهای مناسبی
            هم برای رفع اونها وجود نداره. مهاجرت در سنین بالا، ارزش پایین واحد
            پول نسبت به ارز کشور مقصد، فرصت‌های مهاجرتی به کشورهای غیرانگلیسی
            زبان، عدم داشتن مهارت‌های کافی برای تطبیق با جامعه جدید، معضل
            پناهندگی و ده‌ها دلیل دیگه باعث شده تا طیف نسبتا زیادی از مهاجران،
            کیفیت مطلوب زندگی که در هنگام ترک وطن انتظارش رو داشتند تجربه نکنن!
          </p>
        </div>

        <div className='section'>
          <h2>اقدام ما!</h2>
          <p>
            ما جمعی از متخصصان حوزه تکنولوژی هستیم که جمعا نزدیک به 3 دهه تجربه
            مهاجرت در 3 قاره مختلف رو داریم و عمیقا با مشکلات و مسائل
            فارسی‌زبانان مهاجر آشنا هستیم.
          </p>
          <p>
            ما تصمیم گرفتیم به پشتوانه تخصص و تجربه‌مون یک راهکار کاربردی و
            استاندارد برای چالش‌های فارسی‌زبانان مهاجر ایجاد کنیم تا علاوه بر
            سهولت مسیر پرفراز و نشیب مهاجرت، گام موثری در افزایش کیفیت زندگی شما
            عزیزان برداریم.
          </p>
          <p>
            کـوچـا نتیجه اقدام و اراده ما در راستای کمک به رفع نیازهای
            فارسی‌زبانان مهاجره. میدونیم که راه طولانی و دشواری در پیش داریم اما
            به همراهی و حمایت شما عزیزان امید داریم!
          </p>
        </div>

        <div className='section'>
          <h2>هدف ما!</h2>
          <p className='font-bold text-secondary'>
            هـدف اصـلـی مـا افـزایـش کـیـفـیـت و سـهـولـت زنـدگی فـارسـی
            زبـانـان مـهـاجـره!
          </p>
          <p>
            این کیفیت شاخص‌های متفاوتی داره که مهمترین اونها میتونه تطبیق‌پذیری
            سریع و کم هزینه با جامعه مقصد، به دست آوردن جایگاه اجتماعی، پیدا
            کردن جمع‌های دوستانه محلی و کسب درآمد قابل قبول باشه که ما برای اکثر
            این موارد برنامه جامعی داریم.
          </p>
          <p>
            <strong>1. راهنمای مشاغل:</strong> راه‌اندازی پلتفرم حرفه‌ای برای
            معرفی و رتبه‌بندی مشاغل و پزشکان فارسی‌زبان
          </p>
          <p>
            <strong>2. نیازمندی‌ها:</strong> راه‌اندازی پلتفرم استاندارد برای
            ثبت آگهی‌های دسته‌بندی‌شده فارسی‌زبان (بـزودی)
          </p>
          <p>
            البته امکانات و خدمات کـوچـا به اینجا ختم نمیشه و در آینده نزدیک
            برنامه‌هامون رو باهاتون در میون میذاریم.
          </p>
        </div>

        <div className='section'>
          <h2>ارزش های ما!</h2>
          <p>
            <strong>حفظ حریم شخصی:</strong> ما به حریم شخصی مخاطبان‌مون احترام
            می‌ذاریم و تمام تلاش‌مون رو برای ایجاد امنیت اطلاعات‌شون به کار
            می‌گیریم.
          </p>
          <p>
            <strong>ارتباط برنده - برنده:</strong> ما عمیقا اعتقاد داریم که رمز
            تعاملات سازنده و پایدار در ایجاد منافع مشترک و برنده‌بودن ذی‌نفعان
            است.
          </p>
          <p>
            <strong>سیاست بی سیاست:</strong> ما هیچ گرایش سیاسی نداریم؛ چون
            برخلاف سیاست، ما برای تک تک مخاطبان‌مون ارزش قائلیم.
          </p>
          <p>
            <strong>استقلال، آزادی:</strong> ما به هیچ ارگان غیرمردمی وابسته
            نیستیم و نخواهیم بود تا بتونیم آزادانه در راستای تحقق رویامون قدم
            برداریم.
          </p>
        </div>
      </div>
    </div>
  );
};
export default TextSec;
