import Image from "next/image";

const TextSec = () => {
  return (
    <div className="container max-w-[1144px] mx-auto mt-10 px-3 sm:px-0">
      <div className="text-wrap">
        <div className="section">
          <h2>کوچا، تلاشی برای رفع نیازهای فارسی‌زبانان مهاجر</h2>
          <p>
            در چند دهه گذشته بواسطه شرایط نامساعد زندگی در کشورهای فارسی‌زبان
            بویژه ایران و افغانستان تعداد زیادی از هم‌زبانان عزیزمون مجبور به
            ترک سرزمین مادری‌شون شدن و واژه مهاجرت به بخش جداناپذیری از گفتمان
            روزانه مردم اون منطقه تبدیل شده.
          </p>
          <p>
            رشد بی‌سابقه نرخ مهاجرت چالش‌های گوناگونی رو در زندگی مهاجران و
            خانواده‌هاشون ایجاد کرده که متاسفانه خدمات و راهکارهای مناسبی هم
            برای رفع اونها وجود نداره. مهاجرت در سنین بالا، ارزش پایین واحد پول
            نسبت به ارز کشور مقصد، فرصت‌های مهاجرتی به کشورهای غیرانگلیسی زبان،
            عدم داشتن مهارت‌های کافی برای تطبیق با جامعه جدید، معضل پناهندگی و
            ده‌ها دلیل دیگه باعث شده تا طیف نسبتا زیادی از مهاجران، کیفیت مطلوب
            زندگی که در هنگام ترک وطن انتظارش رو داشتند تجربه نکنن!
          </p>
        </div>

        <div className="section">
          <h2>اقدام ما!</h2>
          <p>
            ما جمع کوچکی از متخصصان حوزه فناوری هستیم که جمعا نزدیک به 30 سال
            تجربه مهاجرت در 3 قاره مختلف رو داریم و عمیقا مشکلات و مسائل
            فارسی‌زبانان در فضای مهاجرت رو زندگی کردیم.
          </p>
          <p>
            ما تصمیم گرفتیم به پشتوانه تخصص و تجربه‌مون راهکاری کاربردی و
            استاندارد برای چالش‌های فارسی‌زبانان مهاجر ایجاد کنیم تا علاوه بر
            سهولت مسیر پرتلاطم مهاجرت، گام موثری در افزایش کیفیت زندگی
            مخاطبان‌مون برداشته باشیم. کوچا نتیجه تصمیم و اقدام ما در راستای کمک
            به رفع نیازهای فارسی‌زبانان مهاجره. میدونیم که راه طولانی و دشواری
            در پیش داریم اما به همراهی و حمایت شما عزیزان امیدوار و دلگرمیم!
          </p>
        </div>

        <div className="section">
          <h2>هدف ما!</h2>
          <p>هدف اصلی ما افزایش کیفیت زندگی فارسی زبانان مهاجره!</p>
          <p>
            این کیفیت شاخص‌های متفاوتی داره که مهمترین اونها میتونه تطبیق‌پذیری
            سریع و کم هزینه، به دست آوردن جایگاه اجتماعی، پیدا کردن جامعه
            دوستانه محلی و کسب درآمد قابل قبول باشه. ما برای رسیدن به این هدف
            برنامه داریم.
          </p>
          <ul>
            <li>
              <strong>راهنمای مشاغل:</strong> ایجاد پلتفرم حرفه‌ای برای معرفی و
              رتبه‌بندی مشاغل و پزشکان فارسی‌زبان
            </li>
            <li>
              <strong>نیازمندی‌ها:</strong> ایجاد پلتفرم استاندارد برای نیازمندی
              فارسی‌زبانان
            </li>
          </ul>
          <p>
            مرحله اول ارائه خدمات کوچا به شما عزیزانه، بزودی برنامه‌های
            آینده‌مون رو هم باهاتون در میون میذاریم.
          </p>
        </div>

        <div className="section">
          <h2>ارزش های ما!</h2>
          <p>
            <strong>حفظ حریم شخصی:</strong> ما به حریم شخصی مخاطبامون احترام
            می‌ذاریم و تمام تلاش‌مون رو برای ایجاد امنیت اطلاعات‌شون به کار
            می‌گیریم.
          </p>
          <p>
            <strong>ارتباط برنده - برنده:</strong> ما عمیقا اعتقاد اریم که رمز
            روابط و تعاملات سازنده و پایدار در ایجاد منافع مشترک و برنده بودن
            ذی‌نفعان است.
          </p>
          <p>
            <strong>سیاست بی سیاست:</strong> ما هیچ گرایش سیاسی نداریم چون
            برخلاف سیاست، ما برای تک تک مخاطبامون ارزش قائلیم.
          </p>
          <p>
            <strong>استقلال، آزادی:</strong> ما به هیچ ارگان غیرمردمی وابسته
            نیستیم و نخواهیم بود تا بتونیم آزادانه در راستای تحقق رویامون قدم
            برداریم.
          </p>
        </div>
      </div>
    </div>
  );
};
export default TextSec;
