"use client";

import Link from "next/link";
import Accordion from "@/client-packages/daisy/accordion";
import ApplyForm from "./form";

const JobsText = () => {
  return (
    <div className="container max-w-[1144px] mx-auto mt-6 sm:mt-10 px-3 sm:px-0">
      <div className="text-wrap">
        <div className="section">
          <h2>تجربه همراه شدن با تیمی که تفاوت ایجاد می‌کنه!</h2>
          <p>
            اگه جزو اون دسته از آدمایی هستی که همیشه در حال رشد کردن هستن و دوست
            دارن تو زندگی خودشون و اطرافیان‌شون تغییر مثبت ایجاد کنن و اکثر روزا
            به این انگیزه از خواب پامیشن، جای درستی اومدی. ما کـوچـا هستیم، یه
            خونواده کوچیک و صمیمی که با یه هدف بزرگ دور هم جمع شدیم، ساختن یه
            جامعه آنلاین برای ایرانیای مهاجر مقیم سراسر دنیا. ما اعتقاد داریم هر
            کسی که به این خونواده پا می‌ذاره، با خودش یک دنیا تجربه و شور و ایده
            میاره. به همین علت با اشتیاق منتظر شنیدن داستان‌ها و ایده‌های ناب
            شما هستیم.
          </p>
          <h2>چرا کـوچـا؟</h2>
          <p className="mb-8">
            <span className="font-semibold">تأثیرگذاری اجتماعی:</span> در
            کـوچـا، تو هم بخشی از یه تحول بزرگ هستی. اینجا کارمون معنا و هدفی
            داره که فراتر از یک شغل معمولیه. همه ما برای بهبود کیفیت زندگی بخشی
            از جامعه ایران که به هر دلیل و روشی مهاجرت کرده تلاش می‌کنیم و تاثیر
            کارمون رو بزودی تو چهره‌های خندون، ارتباطات برقرار شده و موفقیت‌هایی
            که اعضای کـوچـا به دست میارن، مشاهده می‌کنیم. کار ما باعث می‌شه اونا
            بتونن با سرعت بیشتر هزینه کمتر با فرهنگ و جامعه جدیدشون ادغام بشن و
            این چیزیه که به ما انگیزه میده.
          </p>
          <p className="mb-8">
            <span className="font-semibold">محیط کاری پویا:</span> به عنوان عضوی
            از خانواده کـوچـا، در مرکز نوآوری قرار می‌گیری. محیط کاری ما پویا و
            منعطفه و همین باعث میشه هر روز با چالش‌های جدید و هیجان‌انگیزی روبرو
            بشیم. فرصت داری در کنار همکارانی که هرکدام‌شون در زمینه کاری خودشون
            تجربه‌های ارزشمندی دارن کار کنی و از طرز نگرش‌شون الهام بگیری. هر
            پروژه جدید فرصتیه برای شکستن مرزهای خلاقیت و ساختن تجربه‌هایی که
            قبلاً تصورش رو هم نمی‌کردی.
          </p>
          <p>
            <span className="font-semibold">فرصت‌های یادگیری و رشد شخصی:</span>{" "}
            ما باور داریم که یادگیری یک سفر همیشگیه و همین باور رو در محیط
            کاری‌مون هم پیاده‌سازی کردیم. ما برات فضا و منابع لازم یادگیری مستمر
            و ارتقا مهارت‌های شخصی و حرفه‌ایت رو فراهم می‌کنیم تا نه تنها تو
            کارت رشد کنی بلکه به عنوان یه فردی که در جامعه‌ای گسترده‌تر میتونه
            اثرگذار باشه شکوفا بشی. هدف ما اینه که هر عضوی از تیم‌مون بتونه
            بهترین نسخه خودش رو کشف کنه.
          </p>
        </div>

        <Accordion
          title="کارشناس موفقیت مشتری - کارآموزی"
          content={
            <div className="mb-3">
              <p className="mb-3 leading-8">
                کارشناس موفقیت مشتری، فردیه که در زمینه پشتیبانی و خدمات مشتریان
                مهارت داره و روی ارائه راهکارهای موثر برای افزایش رضایت‌مندی و
                موفقیت مشتریان تمرکز می‌کنه. این فرد مسئول شناسایی نیازها و
                خواسته‌های مشتریانه تا بتونه برای حل مسائل و چالش‌های اونها
                راهکار ارائه کنه و برای استفاده بهینه و موثر از خدمات کـوچـا
                بهشون راهنمایی و مشاوره بده. از اونجایی که کارشناس موفقیت مشتری
                بیشترین ارتباط رو با مشتریان برقرار می‌کنه، نیاز داره تا در
                برقراری ارتباط، معرفی خدمات و فروش توانایی کافی داشته باشه.
                بررسی بازار، جمع‌آوری و تحلیل داده‌ها در راستای دستیابی به اهداف
                شرکت از جمله مهارت‌هاییه که در پیشرفت مسیر شغلی به یک کارشناس
                موفقیت مشتری کمک می‌کنه.
              </p>
              <p className="mb-8 leading-8">
                با توجه به اینکه حوزه فعالیت ما کشورهای مختلف هست و ارتباط با
                مشتریان‌مون ظرافت‌های خاص خودش رو داره ترجیح دادیم از طریق آموزش
                و تربیت کارآموز، نیروی انسانی مطلوب‌مون رو تامین کنیم. در همین
                راستا موقعیتی رو فراهم کردیم تا افرادی که به یادگیری و رشد در
                این حوزه علاقه دارند بتونن ازش استفاده کنن. از اونجایی‌که دفتر
                ما در شهر دوسلدورف آلمان هست، طبیعتا فرصت‌های همکاری‌مون برای
                عزیزان داخل ایران بصورت دورکاری خواهد بود.
              </p>
              <h3>مسئولیت‌های شما</h3>
              <ul>
                <li>ایجاد و حفظ روابط موثر با مشتریان</li>
                <li>ثبت و مدیریت اطلاعات مشتریان</li>
                <li>شناسایی و ارزیابی نیازهای مشتریان</li>
                <li>
                  ارائه مشاوره و راهنمایی تخصصی در مورد اهداف و خدمات شرکت
                </li>
                <li>ارتقا تجربه مشتریان و ارائه راهکارهای بهبود خدمات</li>
                <li>پشتیبانی مشتریان از طریق ایمیل و ابزارهای ارتباط آنلاین</li>
                <li>تجزیه و تحلیل بازخوردها و ارائه گزارش به تیم‌های داخلی</li>
              </ul>
              <h3>انتظارات ما</h3>
              <ul>
                <li>منظم، متعهد، جدی، صبور و با انگیزه</li>
                <li>علاقه‌مندی به حوزه امور مشتریان</li>
                <li>اشتیاق به یادگیری</li>
                <li>ذهنیت و روحیه حل مساله</li>
                <li>برون‌گرا و دارای روابط عمومی مناسب</li>
                <li>تسلط کافی به کاربری اینترنت، Word و Excel</li>
              </ul>
              <h3> تعهدات منتورینگ ما</h3>
              <ul>
                <li>مبانی و اصول ارتباط، مذاکره و پشتیبانی مشتریان</li>
                <li>مفاهیم و ابزارهای CRM</li>
                <li>مفاهیم و ابزارهای پشتیبانی</li>
                <li>مدیریت تسک و برنامه ریزی</li>
                <li>مبانی و مفاهیم دیجیتال مارکتینگ</li>
              </ul>
              <h3>مزایای دوره</h3>
              <ul>
                <li>کوچینگ و منتورینگ فردی و حرفه‌ای</li>
                <li>امکان تهیه دوره‌های آموزشی</li>
                <li>آشنایی با فضای کاری خارج از کشور</li>
                <li>پرداخت مبلغ تشویقی در صورت دستیابی به اهداف</li>
              </ul>
              <h3>شرایط دوره</h3>
              <ul>
                <li>این دوره بصورت آنلاین و به مدت 3 ماه برگزار می‌شود.</li>
                <li>ساعات کاری: شنبه تا چهارشنبه از ساعت 10 تا 18</li>
                <li>ظرفیت این دوره 7 نفر می‌باشد.</li>
                <li>
                  امکان استخدام برای 3 نفر برتر دوره پس از اتمام دوره کارآموزی
                </li>
              </ul>
            </div>
          }
          className="item bg-yellow-100 mb-8 rounded-tl-xl rounded-bl-xl border-r-4 border-yellow-500"
        />

        <div className="section">
          <h2>دوست داری هم تیمی ما بشی؟</h2>
          <p className="mb-3">
            عـالـیـه! اگه احساس می‌کنی اینجا همون جاییه که ممکنه توش خوشحال باشی
            و تو همون فردی هستی که ما دنبالش هستیم و دلت می‌خواد با ایده‌ها و
            انرژیت به ما کمک کنی تا کـوچـا رو به یه جامعه کاربردی برای ایرانیای
            مهاجر سراسر دنیا تبدیل کنیم، خیلی دوست داریم که باهات آشنا بشیم.
          </p>
          <p>
            فقط کافیه از طریق فرمی که پایین این صفحه قرار داره اطلاعاتت رو ثبت
            کنی، فایل رزومه‌ات رو آپلود کنی و توی یک یا چند پاراگراف از
            انگیزه‌ات برای به دست آوردن موقعیت شغلی مورد نظرت بنویسی. ما دوست
            داریم بهمون بگی چرا تمایل داری توی تیم ما کار کنی و فکر میکنی که
            چطوری میتونی تاثیرگذار باشی. اگر هم سوالی داری و یا فقط میخوای
            باهامون سلام و احوالپرسی کنی،{" "}
            <Link href={"https://t.me/koochaa_support"} target="_blank">
              آیدی تلگرام
            </Link>{" "}
            بهترین انتخابه. با اشتیاق منتظر شنیدن صدای گرم‌تون هستیم و برای
            شناختن همسفرامون در این مسیر هیجان‌انگیز لحظه شماری می‌کنیم.
          </p>
        </div>
        <ApplyForm />
      </div>
    </div>
  );
};
export default JobsText;
