const TermsText = () => {
  return (
    <div className="container max-w-[1144px] mx-auto mt-10 px-3 sm:px-0">
      <div className="text-wrap">
        <p className="font-semibold">با سلام، به وب سایت "کوچا" خوش اومدید.</p>
        <p>
          این صفحه حاوی مجموعه قوانین و مقرراتیه که به منظور ایجاد فضایی سالم و
          منصفانه، توسط تیم مدیریتی کوچا وضع شده تا علاوه بر رعایت حقوق شما
          عزیزان، تجربه خوشایندی رو در اینجا براتون رقم بزنیم.{" "}
          <span className="font-medium">
            از اونجایی که رعایت این قوانین برای تمام کاربران الزامیه و ثبت نام،
            ورود به پنل کاربری و استفاده از خدمات سایت به منزله مطالعه و موافقت
            شماست، صمیمانه توصیه می‌کنیم که این قوانین رو به دقت مطالعه کنید.
          </span>{" "}
          <span className="text-red-500 text-[15px]">
            (با توجه به اینکه قوانین در طول زمان کامل‌تر میشن، به تاریخ بروزرسانی
            اون دقت کنید)
          </span>
        </p>
        <p className="mt-8 text-primary font-medium">بروز شده در مهرماه 1402</p>
        <h2>1. شرایط استفاده</h2>
        <p>
          لطفاً قبل از استفاده از وب‌سایت "کوچا"، شرایط استفاده را با دقت مطالعه
          فرمایید. با استفاده از خدمات ما، شما موافقت خود را با تمامی شرایط و
          مقررات اعلام می‌نمایید.
        </p>
        <h2>2. حقوق مالکیت معنوی</h2>
        <p>
          تمامی محتواهای موجود در وب‌سایت "کوچا" از جمله متون، تصاویر، نمادها و
          علائم تجاری تحت حفاظت قانونی قرار دارند. هرگونه استفاده غیرمجاز از
          محتواهای وب‌سایت مورد پیگرد قانونی قرار می‌گیرد.
        </p>
        <h2>3. حفاظت از حریم خصوصی</h2>
        <p>
          "کوچا" به حفاظت از حریم خصوصی کاربران خود اهمیت می‌دهد. اطلاعات شخصی
          کاربران بر اساس سیاست حفاظت از حریم خصوصی وب‌سایت مورد استفاده قرار
          می‌گیرد.
        </p>
        <h2>4. قوانین کاربری</h2>
        <p>
          کاربران موظف به رعایت اصول اخلاقی و قوانین کاربری در ارتباط با سایر
          کاربران و تیم پشتیبانی هستند. استفاده از زبان‌های مناسب و احترام به
          دیگران الزامی است.
        </p>
        <h2>5. شرایط مالی</h2>
        <p>
          در صورتی که وب‌سایت "کوچا" خدمات مرتبط با تراکنش‌های مالی ارائه
          می‌دهد، شرایط مالی معمولاً در قسمت‌های مربوطه تبیین می‌شود. لطفاً
          شرایط و قوانین مربوط به تراکنش‌های مالی را با دقت مطالعه نمایید.
        </p>
        <h2>6. تغییرات در قوانین</h2>
        <p>
          "کوچا" اختیار دارد که در هر زمان قوانین و مقررات خود را تغییر دهد.
          تغییرات اعلامی در صفحه قوانین و مقررات منتشر می‌شوند و ادامه استفاده
          از وب‌سایت به معنای موافقت با تغییرات است.
        </p>
        <h2>7. مسئولیت‌ها و محدودیت‌ها</h2>
        <p>
          "کوچا" تلاش دارد تا خدمات مطابق با استانداردهای بالا ارائه دهد، اما
          هیچ گونه مسئولیتی در قبال هرگونه خسارت یا مشکل ناشی از استفاده از
          وب‌سایت ندارد.
        </p>
        <h2>8. تماس با ما</h2>
        <p>
          برای هرگونه پرسش یا ابهام در مورد قوانین و مقررات، می‌توانید با تیم
          پشتیبانی "کوچا" تماس بگیرید. اطلاعات تماس در صفحه تماس با ما قرار
          دارد. با تشکر از اعتماد و همراهی شما. امیدواریم تجربه‌ای مثبت و مفید
          از استفاده از وب‌سایت "کوچا" داشته باشید.
        </p>
      </div>
    </div>
  );
};
export default TermsText;
