import { ArrowPathIcon } from "@heroicons/react/24/outline";
import Link from "next/link";

const TermsText = () => {
  return (
    <div className="container max-w-[1144px] mx-auto mt-10 px-3 sm:px-0">
      <div className="text-wrap">
        <p className="font-semibold">با سلام، به وب سایت "کوچا" خوش اومدید.</p>
        <p>
          این صفحه حاوی مجموعه قوانین و مقرراتیه که به منظور ایجاد فضایی سالم و
          منصفانه، توسط تیم مدیریتی کوچا وضع شده تا علاوه بر رعایت حقوق شما
          عزیزان، تجربه خوشایندی رو در اینجا براتون رقم بزنیم.{" "}
          <span className="font-medium">
            از اونجایی که رعایت این قوانین برای تمام کاربران الزامیه و ثبت نام،
            ورود به پنل کاربری و استفاده از خدمات سایت به منزله مطالعه و موافقت
            شماست، صمیمانه توصیه می‌کنیم که این قوانین رو به دقت مطالعه کنید.
          </span>{" "}
          <span className="text-red-500 text-[15px]">
            (با توجه به اینکه قوانین در طول زمان کامل‌تر میشن، به تاریخ
            بروزرسانی اون دقت کنید)
          </span>
        </p>
        <p className="my-6 text-gray-600 flex items-center">
          <ArrowPathIcon className="w-4 h-4 ml-2" />
          بروز شده در مهرماه 1402
        </p>
        <ol className="list-decimal mb-10">
          <li>حریم خصوصی کاربران</li>
          <p>
            حفاظت از اطلاعات و حریم خصوصی کاربران جزو ارزش‌های اصلی کـوچـاست، از
            این رو تیم فنی ما تمام تلاش خود را به کار گرفته تا با استفاده از
            جدیدترین ابزارها و امن‌ترین فناوری‌های موجود در بازار فضایی امن را
            برای شما عزیزان فراهم نماید.
          </p>
          <li>مالکیت معنوی</li>
          <p>
            تمامی محتوای تولید شده توسط کـوچـا تحت مالکیت معنوی این مجموعه بوده
            و استفاده از آنها بدون هماهنگی و کسب مجوز از نظر قانونی و اخلافی
            ممنوع می‌باشد.
          </p>
          <li>قوانین کاربری</li>
          <p>
            تمامی کاربران سایت موظف به رعایت اصول اخلاقی در ارتباط با سایر
            کاربران و تیم پشتیبانی کـوچـا می‌باشند. استفاده از کلماتی که به هر
            نحو توهین به فردیت، جنسیت، ملیت، قومیت و عقاید دیگران محسوب شود
            ممنوع است.
          </p>
          <li>سلب مسئولیت</li>
          <p>
            کـوچـا پیوسته تلاش می‌کند تا بالاترین کیفیت خدمات رو به کاربران خود
            ارائه نماید دارد اما هیچ گونه مسئولیتی در قبال خدمات ارائه شده توسط
            کسب و کارها و افرادی که اطلاعات آنها در کوچا ثبت شده‌است ندارد و
            هرگونه خسارت ناشی از همکاری و استفاده از محصولات و خدمات آنها متوجه
            شما خواهد بود.
          </p>
          <li>تغییرات در قوانین</li>
          <p>
            کـوچـا اختیار دارد در هر زمان و در راستای بهبود خدماتش قوانین و
            مقررات خود را تغییر دهد. آخرین نسخه از قوانین با ذکر تاریخ بروزرسانی
            همیشه در همین صفحه به آدرس{" "}
            <Link href={"/terms"}>www.koochaa.com/terms</Link> قابل دسترس
            می‌باشد. توجه بفرمایید که ثبت نام، ورود به پنل کاربری و استفاده از
            خدمات سایت به منزله مطالعه و موافقت شما با آخرین بروزرسانی قوانین
            است.
          </p>

          <li>تماس با ما</li>
          <p>
            در صورت بروز هرگونه پرسش یا ابهام در مورد قوانین و مقررات، می‌توانید
            با تیم پشتیبانی کـوچـا تماس بگیرید. روش‌ها و اطلاعات بروز برقراری
            ارتباط با ما همیشه در صفحه تماس با ما به آدرس{" "}
            <Link href={"/contact"}>www.koochaa.com/contact</Link> قرار دارد.
          </p>
        </ol>
        <p>
          از اعتماد و همراهی شما صمیمانه سپاسگزاریم. امیدواریم تجربه‌ خوشایندی
          در استفاده از خدمات ما داشته باشید.
        </p>
      </div>
    </div>
  );
};
export default TermsText;
