import { SeoText } from "../global/SeoText";
import { WrapContainer } from "../layout/WrapContainer";

export const HomeSeo = () => {
  return (
    // <div className="_seo-text [&>p]:text-muted-foreground [&_strong]:font-medium [&>p]:mb-1 [&>p]:text-sm">
    <div className="_SEO-text [&>p]:text-muted-foreground [&_strong]:font-medium [&>p]:mb-1 [&>p]:text-sm">
      <WrapContainer>
        <h1 className="text-primary mb-2 text-center font-semibold">
          کـوچـا، پلتفرم رشد و تبلیغات آنلاین کسب و کارهای ایرانی فعال در سراسر
          دنیاست!
        </h1>
      </WrapContainer>

      <SeoText>
        <p>
          راهکاری یکپارچه برای <strong>ایرانیان مهاجر مقیم</strong> همه کشورها؛
          جایی که <strong>جامعه ایرانی</strong> و{" "}
          <strong>کسب‌وکارهای فارسی‌زبان</strong> فعال در مناطق مختلف به یکدیگر
          متصل می‌شوند تا هم‌افزایی و حمایت متقابل ایجاد کنند.
        </p>
        <p>
          اگر به تازگی <strong>مهاجرت</strong> کرده‌اید و برای رفع نیازهای
          روزمره و تصمیمات مهم به <strong>زبان مادری</strong> و{" "}
          <strong>حمایت و همفکری سایر ایرانیان</strong> نیاز دارید، کوچا برای
          شماست.
        </p>
        <p>
          در اینجا می‌توانید لیست کاملی از{" "}
          <strong>
            مشاغل ایرانی، پزشکان ایرانی، وکلای ایرانی، اینفلوئنسرهای ایرانی،
            هنرمندان ایرانی، انجمن‌های ایرانی و رویدادهای ایرانی
          </strong>{" "}
          در کشورهای مختلف را پیدا کرده و با آنها ارتباط بگیرید.
        </p>
        <p>
          اگر <strong>در حال مهاجرت</strong> هستید، کوچا مجموعه‌ای از اطلاعات
          کاربردی درباره{" "}
          <strong>کار، اقامت، هزینه زندگی و مسیرهای مهاجرت</strong> به کشورهای
          مختلف را ارائه می‌کند که می‌تواند در فرآیند تصمیم‌گیری، برنامه‌ریزی،
          کاهش ریسک و مدیریت هزینه‌های مهاجرت شما مفید باشد.
        </p>
        <p>
          و اگر در خارج از ایران صاحب کسب و کار هستید و خدمات خود را به زبان
          فارسی هم ارائه می‌کنید، کـوچـا{" "}
          <strong>پلتفرم رشد و تبلیغات آنلاین بیزینس</strong> شماست. اینجا
          می‌توانید خدمات خود را به جامعه بزرگ ایرانیان مهاجر معرفی کرده و از{" "}
          <strong>خدمات رشد کسب‌وکار</strong> با کیفیت بالا و قیمت منصفانه
          استفاده کنید.
        </p>
      </SeoText>
    </div>
  );
};
