"use client";

import type { Country } from "@/schemas";
import type { UnitType } from "@/types/unit";
import { useState } from "react";
import { Button } from "../ui";
import { cn } from "@/lib/utils";

type UnitSeoTextProps = {
  currentCountry: Country;
  unit: UnitType;
};

export const UnitSeoText = ({ currentCountry, unit }: UnitSeoTextProps) => {
  const [showMore, setShowMore] = useState(false);

  return (
    <div className="_SEO-text flex flex-col px-4 mt-4">
      <div
        className={cn(
          "text-muted-foreground relative overflow-hidden text-justify text-sm duration-500",
          showMore ? "h-auto" : "h-40",
        )}
      >
        <div
          className={cn(
            "absolute right-0 bottom-0 left-0 h-full",
            showMore ? "" : "bg-gradient-to-t from-white to-transparent",
          )}
        ></div>
        {unit.name === "مشاغل" ? (
          <div className="space-y-2">
            <p>
              در ماه‌های اولیه مهاجرت به {currentCountry.name}، موضوعاتی از قبیل
              فرآیندهای اداری اقامت، بازکردن حساب بانکی، پیدا کردن و مستقر شدن
              در خانه جدید، تامین اثاثیه، حمل و نقل و اسباب کشی، تعمیرات داخلی
              ساختمان، ثبت نام فرزندان در مدرسه، گرفتن گواهینامه رانندگی، خرید
              خودرو، تعمیرات خودرو، الزامات بانکی و بیمه‌ای، یادگیری زبان،
              کاریابی و حتی خدمات آرایش و زیبایی میتونه براتون چالش ایجاد کنه و
              بسته به اینکه چقدر از قبل با زبان و فرهنگ این کشور آشنایی داشته
              باشید براتون هزینه بر باشه. بعد از گذروندن این مراحل و جا افتادن
              در محل جدید زندگی، موضوعات دیگه‌ای مثل پیدا کردن جمع‌های دوستانه،
              مراجعه به پزشک و داروخانه، دریافت خدمات مشاوره روانشناسی و پیدا
              کردن وکیل یا مشاور مالی کاربلد از جمله دغدغه‌های رایج زندگی
              مهاجران تو کشور {currentCountry.name} به شمار میاد. اگر هم تصمیم
              داشته باشید کسب و کار خودتون رو راه بندازید که با چالش‌های متفاوتی
              مثل قوانین اداری و مالیاتی روبرو خواهید شد.
            </p>
            <p>
              در چنین شرایطی دسترسی به لیست کامل و بروز مشاغل فارسی زبان فعال در
              سراسر
              {currentCountry.name} و دریافت خدمات مورد نیاز به زبان مادری یک
              مزیت مهم و کاربردی به حساب میاد و میتونه باعث صرفه جویی در وقت،
              انرژی و هزینه شما بشه.
            </p>
          </div>
        ) : (
          <div className="space-y-2">
            <p>
              در ماه‌های اولیه مهاجرت به {currentCountry.name}، موضوعاتی از قبیل
              بیماری‌های اورژانسی، مراجعه به پزشک و مراکز درمانی، تهیه دارو و
              حتی کمک گرفتن از مشاور و درمانگر چالش‌های زیادی رو برای اکثر
              ایرانیان مهاجر بویژه افرادی که در سنین بالاتر مهاجرت میکنن ایجاد
              می‌کنه. عادت کردن به شیوه نگرش پزشکان داخل ایران به انواع
              بیماری‌ها، روش‌های متفاوت درمان و از همه مهمتر مدل تجویز و مصرف
              دارو در جامعه ما باعث میشه تا ماه‌ها و بعضا سالها طول بکشه تا
              بتونید خودتون رو با فرهنگ پزشکی جامعه {currentCountry.name} تطبیق
              بدید. علاوه بر این صحبت کردن درباره حالات جسمی و روحی به یک زبان
              جدید و بکار بردن کلمات تخصصی برای گزارش دقیق مشکلات پزشکی میتونه
              سخت و آزارنده باشه.
            </p>
            <p>
              در چنین شرایطی دسترسی به لیست کامل و بروز پزشکان فارسی زبان فعال
              در سراسر {currentCountry.name} و دریافت خدمات مورد نیاز به زبان
              مادری میتونه در ابتدا راه حل سریع و کاربردی برای رفع نیازهای مهم و
              حیاتی شما باشه و حتما بعد از ادغام و جا افتادن در شرایط جدید فرصت
              و انتخاب این رو خواهید داشت تا در هر زمینه‌ای پزشک متخصص و
              مناسب‌تون رو فارغ از زبان و فرهنگ پزشکی گذشته‌ و بدون هیچ محدودیتی
              انتخاب کنید.
            </p>
          </div>
        )}
      </div>
      <Button
        variant="link"
        className="text-[13px] text-gray-400"
        onClick={() => setShowMore(!showMore)}
      >
        {showMore ? "عدم نمایش" : "نمایش متن"}
      </Button>
    </div>
  );
};
