export const FOOTER = {
  COPYRIGHT_TEXT1: "تمامی حقوق ناشی از این وب سایت برای",
  COPYRIGHT_TEXT2: "محفوظ است.",
  CALL_SUPPORT: "تماس با پشتیبانی کـوچـا",
  FOLLOW_US: "ما رو در رسانه‌های اجتماعی دنبال کنید.",
  SEO_TEXT:
    "کوچا، یک پلتفرم فارسی زبان برای ایجاد سهولت در زندگی و توانمندی در کسب و کارهای ایرانیان مهاجر مقیم همه جاست. ما قصد داریم با ارائه خدماتی از جمله راهنمای مشاغل فارسی‌زبان، بیزینس سنتر، آگهی نیازمندی‌ها، سامانه انتقال پول و بار مسافری به ایران و بالعکس، کاریابی، فروشگاه آنلاین محصولات ایرانی، معرفی رویدادها و بلاگرها فارسی زبان سهمی در افزایش کیفیت زندگی هموطنان‌مان بعد از مهاجرت داشته باشیم.",
};
