import Link from "next/link";

const JobsText = () => {
  return (
    <div className="container max-w-[1144px] mx-auto mt-10 px-3 sm:px-0">
      <div className="text-wrap">
        <div className="section">
          <h2>تجربه همراه شدن با تیمی که تفاوت ایجاد می‌کنه!</h2>
          <p>
            اگه جزو اون دسته از آدمایی هستی که مدام در حال رشد کردن هستن و دوست
            دارن تو زندگی خودشون و اطرافیان‌شون تغییر ایجاد کنن و اکثر روزا به
            این انگیزه از خواب پامیشن، جای درستی اومدی. ما کـوچـا هستیم، یه
            خونواده کوچیک و صمیمی که با یه هدف بزرگ دور هم جمع شدیم، ساختن یه
            جامعه آنلاین برای ایرانیای مهاجر مقیم سراسر دنیا. ما اعتقاد داریم هر
            کسی که به این خونه پا می‌ذاره، با خودش یک دنیا تجربه و شور و ایده
            میاره. به همین علت با اشتیاق منتظر شنیدن داستان‌ها و ایده‌های ناب
            شما هستیم.
          </p>
          <h2>چرا کـوچـا؟</h2>
          <p>
            <span className="font-semibold">تأثیرگذاری اجتماعی:</span> در
            کـوچـا، تو هم بخشی از یه تحول بزرگ هستی. اینجا کارمون معنا و هدفی
            داره که فراتر از یک شغل معمولیه. همه ما برای بهبود کیفیت زندگی بخشی
            از جامعه ایران که به هر دلیل و روشی مهاجرت کرده تلاش می‌کنیم و تاثیر
            کارمون رو بزودی تو چهره‌های خندون، ارتباطات برقرار شده و موفقیت‌هایی
            که اعضای کـوچـا به دست میارن، مشاهده می‌کنیم. کار ما باعث می‌شه اونا
            بتونن با سرعت بیشتر هزینه کمتر با فرهنگ و جامعه جدیدشون ادغام بشن و
            این چیزیه که به ما انگیزه میده.
          </p>
          <p>
            <span className="font-semibold">محیط کاری پویا:</span> به عنوان عضوی
            از خانواده کـوچـا، در مرکز نوآوری قرار می‌گیری. محیط کاری ما پویا و
            منعطفه و همین باعث میشه هر روز با چالش‌های جدید و هیجان‌انگیزی روبرو
            بشیم. فرصت داری در کنار همکارانی که هرکدام‌شون در زمینه کاری خودشون
            تجربه‌های ارزشمندی دارن کار کنی و از طرز نگرش‌شون الهام بگیری. هر
            پروژه جدید فرصتیه برای شکستن مرزهای خلاقیت و ساختن تجربه‌هایی که
            قبلاً تصورش رو هم نمی‌کردی.
          </p>
          <p>
            <span className="font-semibold">فرصت‌های یادگیری و رشد شخصی:</span>{" "}
            ما باور داریم که یادگیری یک سفر همیشگیه و همین باور رو هم در محیط
            کاری‌مون پیاده‌سازی کردیم. ما برات فضا و منابع لازم یادگیری مستمر و
            ارتقا مهارت‌های شخصی و حرفه‌ایت رو فراهم می‌کنیم. این به این معنیه
            که نه تنها تو کارت رشد می‌کنی بلکه به عنوان یه فردی که در جامعه‌ای
            گسترده‌تر میتونه اثرگذار باشه شکوفا می‌شی. هدف ما اینه که هر عضوی از
            تیم‌مون بتونه بهترین نسخه خودش رو کشف کنه و بهش برسه.
          </p>
        </div>

        <div>
         Accordion
        </div>

        <div className="section">
          <h2>دوست داری هم تیمی ما بشی؟</h2>
          <p>
            عـالـیـه! اگه احساس می‌کنی اینجا همون جاییه که ممکنه توش خوشحال باشی
            و تو همون فردی هستی که ما دنبالش بودیم و دلت می‌خواد با ایده‌ها و
            انرژیت به ما کمک کنی تا کـوچـا رو به یه جامعه کاربردی برای ایرانیای
            مهاجر سراسر دنیا تبدیل کنیم، خیلی دوست داریم که باهات آشنا بشیم.
          </p>
          <p>
            فقط کافیه فرمی که پایین این صفحه است رو تکمیل کنی. اطلاعاتت رو وارد
            کنی، یه پاراگراف کوتاه بهمون بگی چرا دوست داری توی تیم ما کار کنی و
            فکر میکنی که چطوری میتونی تاثیرگذار باشی، بعد هم فایل رزومه ات رو
            آپلود کنی و تـمـام. اگر هم سوالی داری و یا فقط میخوای باهامون سلام و
            احوالپرسی کنی،{" "}
            <Link href={"https://t.me/koochaa_support"} target="_blank">
              آیدی تلگرام
            </Link>{" "}
            بهترین انتخابه. با اشتیاق منتظر شنیدن صدای گرم‌تون هستیم و برای
            شناختن همسفرامون در این مسیر هیجان‌انگیز لحظه شماری می‌کنیم.
          </p>
        </div>
      </div>
    </div>
  );
};
export default JobsText;
